/* Задача 4.Напишете функцията int binarySearch(int a[], int n, int
x), която получава като първи аргумент началото на масив а,
втория аргумент е дължината на масива, а третия аргумент е
числото, което търсим. Знаем, че масива в който ще търсим
елемента е предварително подреден. Сравняваме тъсения
елемент с елемента в средата на масива. Ако той е по голям от
този в средата търсим елемента от средата до края, ако е помалък го търсим в частта от началото до средата. Това се
повтаря, докато елемента от масива не стане равен с търсения.
Тогава връщаме номера на който се намира елемента в масива
или -1 ако не се съдържа в масива. */
#include <stdio.h>
int binarySearch(int a[], int n, int x){
    int i = 0;
    int index = -1;
    for(i=0; i<= n - 5; i++){
        if(a[i] == x) index = i;    
    }
    for(i = 5;i <= n; i++){
        if(a[i] == x) index = i;
    }
    if(index >= 0)
        printf("Number is found at index %d\n", index);
    else
        printf("Number not found. Error %d\n", index);

}
int main(void){
    int a[] = {5, 10, 15, 20, 25, 30, 50, 60, 70,80, 100};
    int n = 10;
    int x = 70;
    binarySearch(a, n, x);
    return 0;
}
