/* Напишете програма, която умножава 2 числа, като
използва пойнтер-и.
Пойнтер-ите не са страшни. Дефинират се като
тип *Х и се използват като *Х. Както променливите,
но със * отпред (и 1 наум!).
Продължение: Опитайте да умножите 2 променливи от
различен тип, използвайки пойнтери. */
#include <stdio.h>
int main(void){
    int a = 0, b = 0;
    printf("a= ");
    scanf("%d", &a);
    printf("b= ");
    scanf("%d", &b);
    int *p1 = &a;
    int *p2 = &b;
    int sum = (*p1) * (*p2);
    printf("Sum is: %d\n", sum);
    float c = 5.5;
    float *p3 = &c;
    printf("Sum1 is %d\n", (*p1) * (*p3));
    return 0;
}