/* Задача 9. Използвайте do-while цикъл, за да напишете функцията void
itoa(int n, char s[ ]), която преобразува число в символен низ (обратната
функция на atoi). do-while цикълът e необходим, тъй като в масива s[ ] ще
трябва да се постави поне един символ, дори ако n е нула. Ако n = 123, за
да вземем последната цифра, трябва да разделим n по модул(%) на
основата на бройната система 10. За да получите чаръктър число, трябва
да съберете резултата с '0' т.е. 48. За да вземете следващото число, трябва
да разделите n на 10. Това продължава докато n е различно от нула. Това
генерира низа в обратен ред – 321, затова използваме функцията
reverse(char s[]); от задача 18 , за да обърнем низа. */
#include <stdio.h>
#include <string.h>
const char m[] = "0123456789";
void itob(int n,char s[]){
     int i=0;
     int c=0;
     if(n < 0) n = -n;
       do{
       i=n%10;
       n/=10;
       s[c]=m[i];
       printf("%c", s[c]);
       c++;
    }    
    while(n>0);
   
 }
 int main(void){
    int n = 0;
    printf("Enter a number: ");
    scanf("%d", &n); 
    char s[] = "";
    printf("Reversed char: ");
    itob(n, s);
 }
