/* Напишете функцията int atof(char *s), която
преобразува стринг в число с десетична запетая. Тази функция е
подобна на разглежданата по-горе atoi(char *s), само че когато се
стигне до . точката, отделяща цялата част от дробната, трябва
да се пусне още един цикъл, който да изчисли числото в
дробната част по същия начин, както е числото в цялата част.
Само че тук при дробната част трябва да имаме една
променлива, която да умножаваме по 10 всеки път до края на
дробната част power *= 10; Накрая трябва да разделим
полученото число на тази променлива, за да получим реалното
число с плаващата заперая на точното място.  */
#include <stdio.h>
float atof(char* s){
  float rez = 0, power = 1;
  int point_seen = 0;
  for (;*s; s++){
    if (*s == '.'){
      point_seen = 1; 
      continue;
    }
    int d = *s - '0';
    if (d >= 0 && d <= 9){
      if (point_seen) power *= 10.0;
      rez = rez * 10.0 + (float)d;
    }
  }
  return rez / power;
}
    


int main(void){
    char s[]  = "125.25";
    printf("%f\n",atof(s));
    return 0;

}